{
    "title": "Hamilton Devices - Tombstone",
    "brand": "Hamilton Devices",
    "description": "Hamilton Devices presents the worlds best double cartridge battery  the Tombstone battery. It boasts of a compact design that offers easy mobility, despite having the ability to fit two cartridges at a single time. Additionally, its ergonomic structure can also be credited with concealing and protecting your cartridges so you can carry them safely and securely wherever you go. Moreover its fine, aesthetic design coupled with its matte black color lends itself well to any environment so you can enjoy the ultimate hits in an inconspicuous manner, even on the go! \r The Tombstone battery can draw from both the cartridges simultaneously since it permits double cartridge usage. Its double feature allows you to mix two flavors for a unique vaping experience or simply double down on your favorite flavor for enhanced use. Whats more, the battery can even be adapted for single cartridge usage  it comes with a tiny adapter that you can simply plug in one of the inlets when you want to enjoy just one cartridge at a time. Its advanced design and functionality make it a must-have item for all vaping lovers. \r The battery has an auto-draw switch mechanism, which means that once youre done loading both the cartridges, all you have to do is simply close the cover and start inhaling to switch it on  as simple as that! Plus it has carb holes that control the air flow depending on the desired intensity of hit. \r The battery can fit both 0.5 ml and 1.0 ml cartridges. While it can be used with any 510 thread cartridge, we recommend that it be paired only with CCELL® cartridges with which theyre engineered to function best. \r Draws from both cartridges at the same time\r Includes an adapter to use for a single cartridge\r Inhale activated, buttonless technology\r Screw-in connector with built-in 510 thread, fits both 0.5ml and 1.0ml cartridges\r Custom color and branding available\r Power: 3.2v  4.2v\r Battery Capacity: 650mAh\r Size: 45 x 18.2 x 81mm\r Rechargeable with Micro-USB Port ( USB charger included )\r Battery only, does not include cartridge  MAINTENANCE TIPS: Any device dealing with oils has the potential to leak and general cleaning maintenance will keep the device at its optimal performance.  RECOMMENDED CLEANING: 1-2x per battery charge or depending on usage with a Q-Tip and rubbing alcohol.",
    "sku": "850012148081",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg",
        "5.jpg",
        "6.jpg",
        "7.jpg",
        "8.jpg"
    ],
    "url": "https://rzsmoke.com/product/hamilton-devices-tombstone/"
}