{
    "title": "Geek Bar Pulse X 25000 Puffs 5pk",
    "brand": "Geek Bar",
    "description": "Dive into a world of unparalleled vaping with the Geek Bar Pulse X 25000 Puffs Disposable Vape. Meticulously crafted for vaping enthusiasts, this exceptional product stands out in the market with its extraordinary performance. With an impressive 25000 puffs capacity, each disposable vape offers long-lasting enjoyment, perfect for your relaxing evenings or lively social events. \r The Geek Bar Pulse X is more than just a vapeit's a tech-savvy gadget that combines convenience with innovation. Its sleek, modern design and user-friendly features make vaping a stylish and effortless experience wherever you go. Additionally, as a disposable device, it supports environmental sustainability, promoting a cleaner, greener planet. \r What makes the Geek Bar Pulse X truly exceptional is its commitment to delivering a consistent, smooth, and unique vaping experience every time. It offers a perfect blend of exquisite flavors and generous cloud production in a lightweight, compact form. Whether you're an experienced vaper or a curious beginner, the Geek Bar Pulse X will elevate your vaping journey to new heights. \r Experience the next level of vaping with the Geek Bar Pulse X 25000 Puffs Disposable Vapea superior choice that embodies quality, longevity, environmental consciousness, and innovative technology. Embrace the future of vaping and geek out with the Geek Bar Pulse X! Detailed Features:  Number of Puffs: Enjoy up to 25000 puffs in regular mode and 15000 puffs in pulse mode. E-liquid Capacity: 18mL of prefilled e-liquid. Nicotine Strength: Strong 5% (50mg) nicotine content. Battery Capacity: Durable 820mAh battery for long-lasting use. Operation: Convenient draw-activated mechanism. Heating Element: Advanced dual-mesh coils for superior performance. Airflow: Adjustable airflow for customized vaping. Display Screen: Innovative 3D curved LED screen. Charging: USB Type-C for quick and easy recharging. Indicators: Battery life and e-liquid level indicators for hassle-free monitoring.",
    "sku": "359109, 353414, 345875, 345876, 345874, 345877, 377980, 353415, 373530, 658643, 373533, 345879, 345880, 345881, 359110, 345882, 377981, 660389, 373532, 660386, 359111, 660388, 377982, 373529, 377983, 345883, 660385, 359107, 359108, 377984, 353416, 345887, 345884, 345885, 354259, 345886, 345888, 353417, 373531",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:",
        "Tags:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg",
        "5.jpg",
        "6.jpg",
        "7.jpg",
        "8.jpg",
        "9.jpg",
        "10.jpg",
        "11.jpg",
        "12.jpg",
        "13.jpg",
        "14.jpg",
        "15.jpg",
        "16.jpg",
        "17.jpg",
        "18.jpg",
        "19.jpg",
        "20.jpg",
        "21.jpg",
        "22.jpg",
        "23.jpg",
        "24.jpg",
        "25.jpg",
        "26.jpg",
        "27.jpg",
        "28.jpg",
        "29.jpg",
        "30.jpg",
        "31.jpg",
        "32.jpg",
        "33.jpg",
        "34.jpg",
        "35.jpg",
        "36.jpg"
    ],
    "url": "https://rzsmoke.com/product/geek-bar-pulse-x-25000-puffs-5pk/"
}