{
    "title": "Hamilton Devices - Cloak",
    "brand": "Hamilton Devices",
    "description": "Hamilton Devices Cloak battery offers a powerful performance alongside discreet use. Sound like a win-win? It sure is! But that doesnt even begin to summarize the tremendous advantages of this amazing product. \r To begin with, the clever ergonomic design of the Cloak battery Cloaks or hides your vaping cartridges, while simultaneously protecting them. Providing a stealth vaping experience, it enables you to carry it wherever you go and use inconspicuously in any environment. Not to mention, it has an ingenious, sleek design that is as stylish as it is concealing! Plus its available in vibrant colors like red, blue, and purple as well as the classic black and white. If youre looking for custom color and branding options, not to worry  weve got you covered. \r The Cloak battery can be used with a half or full gram capacity cartridge and is extremely easy to load and use. With a button-free technology, all you have to do is draw in to switch it on. Moreover, it has carb holes at the bottom, which can be easily covered with a finger as you begin to draw or left exposed to regulate the amount of air flow, depending on whether you want a small or big hit. \r While the battery can function with any standard 510 thread cartridge, itd be best to use it with CCELL® cartridges as its designed to work best with the latter. Its rechargeable with any micro-USB port  a USB charger is included. \r Ergonomically compact design conceals and protects vape cartridges, all while providing an unparalleled vape experience. \r This battery is engineered specifically for use with CCELL® cartridges, but will also work with most 510 thread cartridges. \r Inhale activated, buttonless technology\r Screw-in connector with built-in 510 thread, fits either 0.5ml and 1.0ml cartridges\r Does not work with taller mouthpieces for the 1.0ml size, such as the Chrome Flat mouthpiece or Chrome Fluted mouthpiece\r Custom color and branding available\r Power: 3.2v  4.2v\r Battery Capacity: 650mAh\r Size: 34 x 18.2 x 79.6mm\r Rechargeable with Micro-USB Port ( USB charger included )\r Battery only, does not include cartridge  MAINTENANCE TIPS: Any device dealing with oils has the potential to leak and general cleaning maintenance will keep the device at its optimal performance.  RECOMMENDED CLEANING: 1-2x per battery charge or depending on usage with a Q-Tip and rubbing alcohol.",
    "sku": "850012148005, 850012148012, 850012148029, 850012148036",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg",
        "5.jpg",
        "6.jpg",
        "7.jpg",
        "8.jpg",
        "9.jpg",
        "10.jpg",
        "11.jpg",
        "12.jpg",
        "13.jpg",
        "14.jpg"
    ],
    "url": "https://rzsmoke.com/product/hamilton-devices-cloak/"
}