{
    "title": "Hamilton Devices - The Cube",
    "brand": "Hamilton Devices",
    "description": "With its distinct, one-of-a-kind appearance, Hamilton Devices Cube battery spells luxury, elegance, and taste. Its hard to guess the purpose of this battery, providing users a discrete vaping experience. Besides its sleek design, its unique shape and small size make it extremely easy to carry wherever you go so you can enjoy the ultimate hits whether youre outdoors, at the mall, club, restaurant, or simply running errands. \r Those of you who derive large doses of creativity from vaping can easily keep the Cube on your desk without worrying about it rolling away unlike other round-shaped vapes  its sleek cubey shape makes it perfect for the office environment too! \r In terms of functionality, youd be surprised to know that this battery packs in a lot of performance within its tiny dimensions. Its powered with Hamilton Devices state-of-the-art airflow technology that offers an extraordinary vaping experience, with huge hits. All you have to do is fit it with a 0.5 ml or 1.0 ml cartridge with the vaping oil of your choice and puff away those big clouds of vapor in an uninterrupted manner. \r Plus its safe and secure as the zinc alloy housing keeps the base of the cartridges protected. Couple this feature with the high quality circuit board and you have multiple safeguards. We recommend using the battery with CCELL® cartridges as it is engineered specifically to work with these but of course with its standard thread system, it will work with most 510 thread cartridges. Order the Cube today and get set for a discrete vaping experience, in style!  Battery Capacity: 560mAh Connector: 510 thread Working Voltage: 3.7V Charging Voltage/Current:5V/500mA Charging Time: 1.5 hours Resistance Range: ? 1.0? Size: 32mm(L)*32mm(W)*32mm(H) Operation: Inhale Activated, Buttonless Technology  MAINTENANCE TIPS: Any device dealing with oils has the potential to leak and general cleaning maintenance will keep the device at its optimal performance.  RECOMMENDED CLEANING: 1-2x per battery charge or depending on usage with a Q-Tip and rubbing alcohol.",
    "sku": "850012148241, 850012148272",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg",
        "5.jpg",
        "6.jpg"
    ],
    "url": "https://rzsmoke.com/product/hamilton-devices-the-cube/"
}