{
    "title": "Geek Bar Meloso Max 9000 Puffs 5pk",
    "brand": "Geek Bar",
    "description": "Discover the ultimate in flavor and convenience with the Geek Bar Meloso MAX 9000 Vape 5 Pack. Perfect for retailers looking to stock up on premium disposable vapes, this bundle offers a whopping total of 45,000 puffs across 5 devices. Whether you're a fan of classic flavors or eager to try new blends, the Meloso MAX 9000 has got you covered.\r Each Geek Bar Meloso Max 9000 is designed for performance and satisfaction. With 14mL of nic salt e-liquid and a powerful 600mAh battery, these disposables deliver consistent, high-quality vaping sessions. The dual mesh coils produce thick clouds and true-to-taste candy-inspired flavors, making every puff a delight. Plus, the bottom adjustable airflow allows you to fine-tune your draw to your liking.\r With the Geek Bar Meloso MAX 9000 Vape 5 Pack, you get the best of both worlds: endless flavor options and unbeatable bulk value. Stock up on your favorites or mix and match to keep things interesting. This pack is perfect for sharing or keeping all to yourself for maximum satisfaction. Detailed Features:  Number of puffs: Each disposable offers a substantial 9000 puffs, ensuring long-lasting use and value. E-liquid capacity: Pre-filled with 14mL of nic salt e-liquid, providing a smooth and satisfying nicotine hit. Nicotine Strength: Contains 5% nicotine by weight (50mg/mL), delivering a strong and enjoyable experience. Battery capacity: Equipped with a robust 600mAh battery that ensures consistent performance throughout its lifespan. Dual mesh coils: Designed to create thick, flavorful clouds with every puff, enhancing the overall vaping experience. Adjustable airflow: Features bottom adjustable airflow, allowing you to customize your draw for optimal comfort and flavor. Indicators: E-Liquid Indicator (Red <15%, Yellow 15-50%, Green 50-100%) and Battery Indicator (Red <20%, Blue 20-50%, Green 50-100%) keep you informed about your vape's status at all times.",
    "sku": "297069",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg",
        "5.jpg",
        "6.jpg",
        "7.jpg",
        "8.jpg",
        "9.jpg",
        "10.jpg",
        "11.jpg",
        "12.jpg",
        "13.jpg",
        "14.jpg",
        "15.jpg",
        "16.jpg",
        "17.jpg",
        "18.jpg",
        "19.jpg",
        "20.jpg",
        "21.jpg",
        "22.jpg",
        "23.jpg",
        "24.jpg",
        "25.jpg",
        "26.jpg",
        "27.jpg",
        "28.jpg",
        "29.jpg",
        "30.jpg",
        "31.jpg",
        "32.jpg"
    ],
    "url": "https://rzsmoke.com/product/geek-bar-meloso-max-9000-puffs-10pk/"
}