{
    "title": "Hamilton Devices - The Shiv",
    "brand": "Hamilton Devices",
    "description": "Hamilton Devices is proud to present the Shiv  our first-ever variable voltage battery. With a mechanism that allows users to adjust the battery voltage, its designed to offer vapers not only the ultimate hits but also the ultimate control over their vaping. \r The Shiv is equipped with a deploy and retract technology with which you can adjust the voltage to a tenth of a volt or as per your requirements for a more precise heat control. How does it work? Its quite simple really: On each click of the plus (or minus) adjust button, the voltage increases (or decreases) by 0.1 volt. \r Besides variable voltage adjustment control, the Shiv also offers discretion. As you push the thumb slide up, the cartridge is instantly deployed, ready for use and as you move it downward, it is immediately retracted back to its concealed position. Its stealth use makes it an instant hit with all types of crowds as does its aesthetic appeal! Its sleek build lends it a contemporary look. Besides, its design makes it hard for onlookers to guess what its really used for, unless you tell them! Whats more is that you can even have the color and branding customized to fit your unique needs. \r The Shivs small size makes it easily portable so you can carry it with ease wherever you go. Simply slide it into your trouser packet or carry it in your purse so youre not deprived of your next puff, even on the go. But dont be fooled by the batterys tiny dimensions  it works with both 0.5 ml and 1.0 ml cartridges. Are you ready for a vaping experience that you can control? Order the Shiv today!  MAINTENANCE TIPS: Any device dealing with oils has the potential to leak and general cleaning maintenance will keep the device at its optimal performance. RECOMMENDED CLEANING: 1-2x per battery charge or depending on usage with a Q-Tip and rubbing alcohol.",
    "sku": "299043, 299044, 299045, 850012148401",
    "categories": [
        "SKU:",
        "Brand:",
        "Categories:"
    ],
    "flavors": [],
    "images": [
        "1.jpg",
        "2.jpg",
        "3.jpg",
        "4.jpg"
    ],
    "url": "https://rzsmoke.com/product/hamilton-devices-the-shiv/"
}